Tekla Open API Reference for Tekla Structures 2025
ICurve.Length Property
 Gets the length of the curve
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
double Length { get; }
ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
ICurve Interface
Tekla.Structures.Geometry3d Namespace